let num = parseFloat(prompt("Введіть число", "0"));
/*while (!Number.isInteger(num)) {  тут працює до тих пір доки ввожу не ціле число і після цього
  цикл не завершується, навіть якщо ввожу все правильно...:(
  promt = parseFloat(prompt("Введіть число", "0"));
} */
if (Number.isInteger(num)) {
  //Перевірка чи ціле введене число
  alert(num); //Висести за допомогою модального вікна браузера число, яке введе користувач
} else {
  num = prompt("Введіть число", "0");
}
//Створюємо цикл, який пробігає числа від 0 до num
for (let i = 1; i < num; i++) {
  //Перевіряємо умову ділення на 5, якщо тру
  if (i % 5 == 0) {
    console.log(i); //Тоді в консоль повертаємо це число
  }
  if (num < 5) {
    /*створюємо нову умову. Бо якщо залишити в циклі то буду перевірятися окреме число. Всі проміжки 
    до чисел більше 5, будуть мати числа які діляться на 5*/
    console.error("Sorry, no numbers");
  }
}
